In [1]:
# standard imports
import pandas as pd
import numpy as np

# Pandas tutorial (based on: https://www.youtube.com/watch?v=PcvsOaixUh8)
## Series

In [2]:
list_1 = ['a', 'b','c', 'd']
labels = [1,2,3,4]
ser_1 = pd.Series(data=list_1, index=labels)
print(ser_1)
ser_1

1    a
2    b
3    c
4    d
dtype: object

1    a
2    b
3    c
4    d
dtype: object

In [3]:
dict_1 = {'f_name' : "daniel", 'l_name' : "schmied", 'age' : 38}
ser_2 = pd.Series(dict_1, name='personInfo')
ser_2['f_name']
ser_2.name

'personInfo'

## Dataframes

In [4]:
rand_arr = np.random.randint(10,50,size=(2,3))
df_1 = pd.DataFrame(rand_arr, ['Row_1', 'Row_2'], ['Col_1','Col_2','Col_3'])
df_1

       Col_1  Col_2  Col_3
Row_1     30     11     20
Row_2     48     47     13

In [5]:
persons_df = ['Daniel', 'Claudia', 'Tim']
person_attributes = {'weight': "Weight [kg]", 'height':"Height [cm]"}
weights_df = [80, 60, 25]
heights_df = [180, 160, 125]
dict_df = {person_attributes['weight'] : pd.Series(weights_df, persons_df), 
           person_attributes['height'] : pd.Series(heights_df, persons_df)}
df_2 = pd.DataFrame(dict_df)
df_2

         Weight [kg]  Height [cm]
Daniel            80          180
Claudia           60          160
Tim               25          125

## Editing & retrieving Data

In [6]:
df_2[[person_attributes['weight']]]

         Weight [kg]
Daniel            80
Claudia           60
Tim               25

In [7]:
df_2.loc['Daniel']

Weight [kg]     80
Height [cm]    180
Name: Daniel, dtype: int64

In [8]:
df_2.iloc[0]

Weight [kg]     80
Height [cm]    180
Name: Daniel, dtype: int64

In [9]:
df_2['BMI'] = df_2[person_attributes['weight']] / (0.01*df_2[person_attributes['height']])**2 
df_2

         Weight [kg]  Height [cm]        BMI
Daniel            80          180  24.691358
Claudia           60          160  23.437500
Tim               25          125  16.000000

## Conditional selection

In [10]:
array_cs = np.random.randint(10,50,size=(2,3))
array_cs

array([[28, 18, 42],
       [42, 19, 21]])

In [11]:
df_cs = pd.DataFrame(array_cs, ['row1', 'row2'], ['col1', 'col2', 'col3'])
df_cs

      col1  col2  col3
row1    28    18    42
row2    42    19    21

In [12]:
print("Greater then 40 \n", df_cs.gt(40))

Greater then 40
        col1   col2   col3
row1  False  False   True
row2   True  False  False

In [13]:
cond = df_cs.gt(40)
df_cs[cond]

      col1  col2  col3
row1   NaN   NaN  42.0
row2  42.0   NaN   NaN

### ways of acessing rows or columns of a dataframe

In [14]:
# setting up the dataframe
persons_df_local = ['Daniel', 'Claudia', 'Tim']
person_attributes_local = {'weight': "Weight [kg]", 'height':"Height [cm]"}
weights_df_local = [80, 60, 25]
heights_df_local = [180, 160, 125]
dict_df_local = {person_attributes_local['weight'] : pd.Series(weights_df_local, persons_df_local), 
           person_attributes_local['height'] : pd.Series(heights_df_local, persons_df_local)}
df_2_local = pd.DataFrame(dict_df_local)
df_2_local

         Weight [kg]  Height [cm]
Daniel            80          180
Claudia           60          160
Tim               25          125

In [15]:
# accessing dataframe columns by attribute name
df_2_local[person_attributes_local['weight']]

Daniel     80
Claudia    60
Tim        25
Name: Weight [kg], dtype: int64

In [16]:
# acessing datagrame rows by index name ("label")
df_2_local.loc['Daniel']

Weight [kg]     80
Height [cm]    180
Name: Daniel, dtype: int64

In [25]:
# acessing datagrame rows by index
df_2_local.iloc[0]

Weight [kg]     80
Height [cm]    180
Name: Daniel, dtype: int64

## File In- / Output

In [18]:
cd_IO = pd.read_csv('ComputerSales.csv')
#cd_IO

### !DRAFT! (mySQL-db not setup yet) importing data from mySQL-db

In [22]:
import pymysql

In [24]:
# try to establish a connection to the mySQL-db
try:
    db_connection = pymysql.connect(db='dbName', user='userName', passwd='pwd', host='localhost', port=1232424)
    # create a dataframe for the SQL-query
    db_df = pd.read_sql('SELECT * FROM dbName', con=db_connection)
except Exception as e:
    print("Exception : {}".format(e))
finally:
    # make sure the db-connection always is closed
    db_connection.close()

Exception : (2003, "Can't connect to MySQL server on 'localhost' ([Errno 8] nodename nor servname provided, or not known)")